{"_id":{"$oid":"5d96215afb240f89d780b45a"},"title":"Introduction to Nius Owsem","body":"\u003ch4\u003eAbout Nius Owsem\u003c/h4\u003e\r\nNius Owsem developed for the assignment of our (*soviet anthem intensifies) team (consisting of me, fahrul, \u0026 hilmi) on Network Programming class. As you can see, it ain't much but an honest work, not the most sophisticated website you've known definitely. Okay so what can this website do? Well it's a CRUD website with the theme of a news website inspired mostly by \"\u003ca href=\"https://tirto.id/\"\u003eTirto.ID\u003c/a\u003e.\" As a CRUD, it can insert a new content, view content(s), edit a content, and delete a content. The front-end uses HTML, Bootstrap, some CSS (adjustment), Font Awesome for the icons, and jQuery. The back-end uses Go, and some third party packages of Go (viper, gorilla/mux, and MongoDB Driver). Wait MongoDB? Yes, Nius Owsem uses MongoDB as the database (quiet unusual to use unlike some database you might have tried).\u003cbr\u003e\u003cbr\u003e\r\n\u003ch4\u003eSome Feature of Nius Owsem\u003c/h4\u003e\r\nNius Owsem had a reaction-meter that shows you how positive/neutral/or negative a news is, shown in number from negative to positive near the mask-thingy icon. You can of course react to the news when you reach the view page of it by clicking one of the three emoticon on the bottom of the news.\u003cbr\u003e\u003cbr\u003e\r\nTo your bottom right side you might notice a blue icon with a triangle inside a square, that the auto up button so you can go the uppermost of the page instantly without scrolling up.\u003cbr\u003e\u003cbr\u003e\r\nThe website's form also had an experimental text editor that uses HTML tag like the \u003c'br'\u003e for newline, \u003c'h4'\u003e for the subsection, \u003c'i'\u003e for the italic text, \u003c'a'\u003e for link, and \u003c'img'\u003e for image. The text/link wrapped in tag will be appended on the end of the body's form, be sure to correct it yourself if you need 'em somewhere else. You've seen the newline, subsection, and link example this news uses right now, so yeah it actually a text/link wrapped in HTML tag, you'll see it yourself if you post a new news or edit a news. Now i'm going to show you the other example. Let start with \u003ci\u003eitalic, mama mia it's in italic now\u003c/i\u003e, okay onto the image example now:\u003cbr\u003e\u003cbr\u003e\r\n\u003ccenter\u003e\u003cimg class=\"img-fluid\" src=\"https://ourfunnylittlesite.com/wp-content/uploads/2019/09/smudge.jpg\"\u003e\u003cbr\u003eSmudge cat meme\u003c/center\u003e\u003cbr\u003e\r\nThe image tag can only use url (complete with the http:// or https://, same with the link) to show the image (again, it ain't much but an honest work), so be sure to upload your image in a drive or others, or you just StEaL MeMe like i did (Mwahahahaha). You can optionally give the image a description like the example above.\u003cbr\u003e\u003cbr\u003e\r\n\u003ch4\u003eTo Sum It Up...\u003c/h4\u003e\r\nFeel free to use this website's code (with adjustments here and there) or browse on this website (for killing time i suppose) to developed your own website, well of course for the assignment first then your very own website for serious project. Have a gud day, comrade...","author":"Javiar Fasyah","date":"2019-10-03","react":{"$numberLong":"1"},"count":{"$numberLong":"1"}}
